app/Controllers/Obra.php

    public function index()
    {
        $obras = $this->obraModel->findAll();
        $editoras = $this->editoraModel->findAll();
---
SELECT *
FROM `obra`
SELECT *
FROM `editora`

    public function editar($id){
        $dados = $this->obraModel->find($id);
        $dadosEditora = $this->editoraModel->findAll();
        $dadosAutor = $this->autorModel->findAll();
---
SELECT *
FROM `obra`
WHERE `obra`.`id` = '2'
SELECT *
FROM `editora`
SELECT *
FROM `autor`