app/Controllers/Usuario.php

SELECT *
FROM `usuario`
---
    public function index(){
        $dados = $this->usuarioModel->findAll();

SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '1'
---
    public function editar($id){
        $dados = $this->usuarioModel->find($id);